Revit 2016 API
LoadCombination Members
The LoadCombination type exposes the following members.
Methods
Name | Description
ArePhasesModifiable
 Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.
 (Inherited from Element.)
CanBeHidden
Indicates if the element can be hidden in the view.
 (Inherited from Element.)
CanBeLocked
 Identifies if the element can be locked.
 (Inherited from Element.)
CanHaveAnalyticalModel
 Indicates whether the Element can have an Analytical Model.
 (Inherited from Element.)
CanHaveTypeAssigned()
 Identifies if the element can have a type assigned.
 (Inherited from Element.)
ChangeTypeId(ElementId)
 Changes the type of the element.
 (Inherited from Element.)
Create(Document, String)
 Creates a new default LoadCombination.
Create(Document, String, LoadCombinationType, LoadCombinationState)
 Creates a new LoadCombination.
DeleteEntity
 Deletes the existing entity created by %schema% in the element
 (Inherited from Element.)
Dispose |  (Inherited from Element.)
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetAnalyticalModel
 Retrieves writeable Analytical Model for Element.
 (Inherited from Element.)
GetAnalyticalModelId
 Retrieves the Element Id of the Analytical Model Element for this Element.
 (Inherited from Element.)
GetCaseAndCombinationIds
 Returns collection of the load combination case and combination IDs.
GetComponents
 Returns collection of the load combination components.
GetEntity
 Returns the existing entity corresponding to the Schema if it has been saved in the Element, or an invalid entity otherwise.
 (Inherited from Element.)
GetEntitySchemaGuids
 Returns the Schema guids of any Entities stored in this element.
 (Inherited from Element.)
GetExternalFileReference
 Gets information pertaining to the external file referenced by the element.
 (Inherited from Element.)
GetExternalResourceReference
 Gets the ExternalResourceReference associated with a specified external resource type.
 (Inherited from Element.)
GetExternalResourceReferences
 Gets the full map of the external resource references referenced by the element.
 (Inherited from Element.)
GetGeneratingElementIds
 Returns the ids of the element(s) that generated the input geometry object.
 (Inherited from Element.)
GetGeometryObjectFromReference
 Retrieve one geometric primitive contained in the element given a reference.
 (Inherited from Element.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetMaterialArea
 Gets the area of the material with the given id.
 (Inherited from Element.)
GetMaterialIds
 Gets the element ids of all materials present in the element.
 (Inherited from Element.)
GetMaterialVolume
 Gets the volume of the material with the given id.
 (Inherited from Element.)
GetMonitoredLinkElementIds
 Provides the link instance IDs when the element is monitoring.
 (Inherited from Element.)
GetMonitoredLocalElementIds
 Provides the local element IDs when the element is monitoring.
 (Inherited from Element.)
GetOrderedParameters
 Gets the parameters associated to the element in order.
 (Inherited from Element.)
GetParameterFormatOptions
 Returns a FormatOptions override for the element Parameter, or a default FormatOptions if no override exists.
 (Inherited from Element.)
GetParameters
Retrieves the parameters from the element via the given name.
 (Inherited from Element.)
GetPhaseStatus
 Gets the status of a given element in the input phase
 (Inherited from Element.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
GetTypeId
 Returns the identifier of this element's type.
 (Inherited from Element.)
GetUsageIds
 Returns collection of the load combination usage IDs.
GetValidTypes()
 Obtains a set of types that are valid for this element.
 (Inherited from Element.)
HasPhases
 Returns true if this Element has the properties CreatedPhaseId and DemolishedPhaseId.
 (Inherited from Element.)
IsExternalFileReference
 Determines whether this Element represents an external file.
 (Inherited from Element.)
IsHidden
Identifies if the element has been permanently hidden in the view.
 (Inherited from Element.)
IsMonitoringLinkElement
 Indicate whether an element is monitoring any elements in any linked models.
 (Inherited from Element.)
IsMonitoringLocalElement
 Indicate whether an element is monitoring other local elements.
 (Inherited from Element.)
IsPhaseCreatedValid
 Returns true if createdPhaseId is an allowed value for the property CreatedPhaseId in this Element.
 (Inherited from Element.)
IsPhaseDemolishedValid
 Returns true if demolishedPhaseId is an allowed value for the property DemolishedPhaseId in this Element.
 (Inherited from Element.)
IsValidType(ElementId)
 Checks if given type is valid for this element.
 (Inherited from Element.)
LookupParameter
Attempts to find a parameter on the element which has the given name.
 (Inherited from Element.)
RefersToExternalResourceReference
 Determines whether this Element uses external resources associated with a specified external resource type.
 (Inherited from Element.)
RefersToExternalResourceReferences
 Determines whether this Element uses external resources.
 (Inherited from Element.)
SetComponents
 Sets a collection of the load combination components.
SetEntity
 Stores the entity in the element. If an Entity described by the same Schema already exists, it is overwritten.
 (Inherited from Element.)
SetUsageIds
 Sets a collection of the load combination usage IDs.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
AssemblyInstanceId
 The id of the assembly instance to which the element belongs.
 (Inherited from Element.)
BoundingBox
Retrieves a box that circumscribes all geometry of the element.
 (Inherited from Element.)
Category
Retrieves a Category object that represents the category or sub category in which the element resides.
 (Inherited from Element.)
CombinationCaseName |  Obsolete.
Returns load combination case name.
CombinationNatureName |  Obsolete.
Returns load combination nature name of load case element.
CombinationState |  Obsolete.
Returns load combination state.
CombinationStateIndex |  Obsolete.
Returns the index in predefined load combination state array {}.
CombinationType |  Obsolete.
Returns load combination type.
CombinationTypeIndex |  Obsolete.
Returns the index in predefined load combination type array.
CreatedPhaseId
 Id of a Phase at which the Element was created.
 (Inherited from Element.)
DemolishedPhaseId
 Id of a Phase at which the Element was demolished.
 (Inherited from Element.)
DesignOption
Returns the design option to which the element belongs.
 (Inherited from Element.)
Document
Returns the Document in which the Element resides.
 (Inherited from Element.)
Factor |  Obsolete.
Returns factor value.
Geometry
Retrieves the geometric representation of the element.
 (Inherited from Element.)
GroupId
 The id of the group to which an element belongs.
 (Inherited from Element.)
Id
 A unique identifier for an Element in an Autodesk Revit project.
 (Inherited from Element.)
IsThirdPartyGenerated
 Indicates if the load combination was created by API.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from Element.)
LevelId
 The id of the level associated with the element.
 (Inherited from Element.)
Location
This property is used to find the physical location of an element within a project.
 (Inherited from Element.)
Name
A human readable name for the Element.
 (Inherited from Element.)
NumberOfComponents |  Obsolete.
Returns number of factors.
NumberOfUsages |  Obsolete.
Returns number of usages.
OwnerViewId
 The id of the view that owns the element.
 (Inherited from Element.)
Parameter[Guid]
Retrieves a parameter from the element given a GUID for a shared parameter.
 (Inherited from Element.)
Parameter[BuiltInParameter]
Retrieves a parameter from the element given a parameter id.
 (Inherited from Element.)
Parameter[Definition]
Retrieves a parameter from the element based on its definition.
 (Inherited from Element.)
Parameters
Retrieves a set containing all of the parameters that are contained within the element.
 (Inherited from Element.)
ParametersMap
Retrieves a map containing all of the parameters that are contained within the element.
 (Inherited from Element.)
Pinned
 Identifies if the element has been pinned to prevent changes.
 (Inherited from Element.)
State
 The state of the load combination.
Type
 The type of the load combination.
UniqueId
 A stable unique identifier for an element within the document.
 (Inherited from Element.)
UsageName |  Obsolete.
Returns usage value.
ViewSpecific
 Identifies if the element is owned by a view.
 (Inherited from Element.)
WorksetId
 Get Id of the Workset which owns the element.
 (Inherited from Element.)
See Also
LoadCombination Class
Autodesk.Revit.DB.Structure Namespace